README.md

# Table of Contents

1.  [About AISer](#org68299f9)
2.  [Requirement](#org15b3938)
3.  [Usage](#orge821e55)
4.  [Examples](#org6c418b5)
    1.  [hello<sub>world.py</sub>](#orgc9ec06a)



<a id="org68299f9"></a>

# About AISer

This script, named aiser.sh, is designed to enhance your shell experience by using AI to provide helpful insights and suggestions based on the 
content you provide. The default AI model used in this script is Ollama Zephyr, but you can easily change it by modifying the \`ai<sub>cmd</sub>\` variable at the 
top of the file.

The script takes one or more filenames as arguments, reads their contents (if they are files), and passes them along with some contextual information to 
the AI for analysis. The output generated by the AI is displayed on the screen for your review.


<a id="org15b3938"></a>

# Requirement

-   Ollama and Zephyr model
    Follow instructions in [Ollama](https://github.com/ollama/ollama) to install and pull Zephyr model "ollama pull zephyr"


<a id="orge821e55"></a>

# Usage

1.  Open a terminal or command prompt window.
2.  Navigate to the directory where you saved the aiser.sh script.
3.  Make the script executable by running the following command: \`chmod +x aiser.sh\`
4.  The script will display the contents of each file, followed by a prompt asking you for some contextual information about the file(s) in question. Type

your input and press Enter.

1.  The AI will generate a response based on the provided input, which will be displayed on the screen. You can review this output to get insights,

suggestions, or clarifications related to the content of the file(s).


<a id="org6c418b5"></a>

# Examples


<a id="orgc9ec06a"></a>

## hello<sub>world.py</sub>

CMD: aiser.sh about hello<sub>world.py</sub>
output:
"""
about file hello<sub>world.py</sub> 

---

The provided Python script \`hello<sub>world.py</sub>\` is a simple program that prints the string "Hello World!" using the built-in \`print()\` function. The shebang 
line at the beginning of the file specifies the path to the Python interpreter to be used when executing the script on Unix-like systems like Linux or 
macOS. In this case, we've specified \`python3\` as the interpreter using the \`env\` command. When you run this script, it will output "Hello World!" to the 
console.
"""

Note: If you want to further customize your AI experience, you can modify the \`ai<sub>cmd</sub>\` variable at the top of the script to use a different AI model or 
command.

Enjoy exploring the possibilities of this script!

